package cc

// 循环码
// 设C为(n,k)线性分组码的码组集合。对C中任意码组c定义
//
//     c = (a(n-1) a(n-2) ...... a0)  c ∈C
//
// 循环移位1位
//     c¹= (a(n-2) a(n-3) ...... a0 a(n-1))  c¹∈C
// 循环移位2位
//     c²= (a(n-3) a(n-4) ...... a0 a(n-1) a(n-2))  c²∈C
// 循环移位i位
//     cⁱ = (a(n-i-1)) a(n-i-2) ...... a0 a(n-1) a(n-2) a(n-i))  cⁱ ∈C
//
//-----------------------------------------------------------------------
// 码多项式 表示循环码
//
//     c = (a(n-1) a(n-2) ...... a0)  c ∈C
// 用多项式表示
//
//	   c(x) = a(n-1)x⁽ⁿ⁻¹⁾ + a(n-2)x⁽ⁿ⁻²⁾ + .... + a₀x⁰
//
// eg: 某码组1100101 用多项式表示
//     c₇(x) = 1·x⁶ + 1·x⁵ + 0·x⁴+ 0·x³ + 1·x²+ 0·x¹+ 1
//           = x⁶ + x⁵ + x²+ 1
//
//-----------------------------------------------------------------------
// 二进制系统循环码.
// 1. 循环码完全由码组长度n和生成多项式g(x) 决定
type CyclicCode interface {
}
